{
  "backend/main.mo": "Backend canister implementing file storage, folder management, access control, approval flows, role assignment, and basic user profile handling.",
  "feature_evidence.json": "Feature evidence report listing features, affected files, components, test IDs, and confidence levels for recent UI and preview viewer enhancements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of all major frontend files and components.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component managing authentication, access control, profile setup flow, conditional UI loading, and frontend canister ID registration.",
  "frontend/src/components/AccessDenied.tsx": "Pending-approval screen showing user principal info and copy-to-clipboard UI.",
  "frontend/src/components/AdminManagement.tsx": "Empty file placeholder for admin management UI.",
  "frontend/src/components/FileList.tsx": "Comprehensive file/folder manager with navigation, search, uploads, previews, creation, deletion, and modal-based file viewing.",
  "frontend/src/components/FilePreviewModal.tsx": "Modal component that loads and previews files of various types with navigation, fullscreen, and download support.",
  "frontend/src/components/FileUpload.tsx": "Empty file placeholder for the upload component.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright text and a link with an icon.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling login/logout, theme toggle, user info display, and admin panel access.",
  "frontend/src/components/ManagePanel.tsx": "Admin dialog for managing members, roles, storage stats, and user removal with mutation hooks.",
  "frontend/src/components/ProfileSetup.tsx": "User onboarding form that validates and saves unique usernames with debounced checks.",
  "frontend/src/components/ThemeToggle.tsx": "Button that switches between light and dark themes using next-themes.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor instance tied to identity, invalidating queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider for Internet Identity handling login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user access checks, profile operations, approvals, and file queries using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light/dark theme color tokens and layout defaults.",
  "frontend/src/lib/appVersion.ts": "Exports the current application version string.",
  "frontend/src/lib/canisterIds.ts": "Resolves backend and frontend canister IDs from env vars, window, URL, or fallback sources.",
  "frontend/src/lib/fileTypes.ts": "Utility functions for file extensions, MIME types, and determining preview capabilities.",
  "frontend/src/main.tsx": "App entry point initializing React Query, Internet Identity provider, and rendering the root component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata describing project features, versions, and functional summaries for an ICP-based file storage app."
}