{
  "backend/main.mo": "Main backend canister handling blob storage, access control, approvals, user profiles, file and folder metadata, and admin management utilities.",
  "backend/migration.mo": "Migration module updating stored appVersion to 0.3.88.",
  "feature_evidence.json": "Report mapping feature requirements to affected frontend files and component versions.",
  "frontend-file-summaries.txt": "Text file containing high-level summaries for multiple frontend source files.",
  "frontend/index.html": "HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Root React component managing authentication, access control, profile setup, and conditional rendering of the file interface.",
  "frontend/src/components/AccessDenied.tsx": "UI screen shown to authenticated users without approval, displaying their principal ID and copy functionality.",
  "frontend/src/components/AdminManagement.tsx": "Empty placeholder file for admin management UI.",
  "frontend/src/components/FileList.tsx": "Full file and folder browser supporting navigation, search, uploads, deletion, moving, and opening files in the preview modal.",
  "frontend/src/components/FilePreviewModal.tsx": "Modal component that loads and previews various file types with navigation, fullscreen, and error handling.",
  "frontend/src/components/FileUpload.tsx": "Empty file placeholder with no implementation.",
  "frontend/src/components/Footer.tsx": "Simple footer showing credits and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with login/logout handling, user display, theme toggle, and admin panel access.",
  "frontend/src/components/ManagePanel.tsx": "Admin panel for managing members, roles, storage stats, and removing or adding users.",
  "frontend/src/components/ProfileSetup.tsx": "Form for creating a user profile with username validation and uniqueness checks.",
  "frontend/src/components/ThemeToggle.tsx": "Button that switches between light and dark themes.",
  "frontend/src/hooks/useAccessBootstrap.ts": "Bootstraps access control once per session and refreshes related query data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication state and login flow using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods, handling user access, profiles, files, and admin actions.",
  "frontend/src/index.css": "Sets up Tailwind CSS base styles and defines light/dark theme CSS variables for UI styling.",
  "frontend/src/lib/appVersion.ts": "Exports the current application version string.",
  "frontend/src/lib/canisterIds.ts": "Retrieves backend and frontend canister IDs from multiple environment and runtime sources.",
  "frontend/src/lib/fileLinks.ts": "Generates full direct file URLs and provides a clipboard copy helper with toast notifications.",
  "frontend/src/lib/fileTypes.ts": "Utility functions to detect file extensions, MIME types, and previewability.",
  "frontend/src/lib/searchNormalize.ts": "Provides Unicode-aware text normalization and substring search helpers.",
  "frontend/src/lib/subtreeIndex.ts": "Computes a set of folder IDs representing a subtree by building a parent‑child index and traversing descendants.",
  "frontend/src/main.tsx": "Bootstraps the React app, initializing QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state, goals, and feature requirements for restoring file explorer and preview behavior for release v0.3.88."
}