{
  "backend/main.mo": "Main backend actor handling blob storage, access control, user approvals, profiles, file/folder metadata, and role-restricted admin operations.",
  "feature_evidence.json": "Feature evidence report linking the file search fix to affected frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their purpose and functionality.",
  "frontend/index.html": "HTML entry point bootstrapping the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app component managing authentication, access checks, profile setup, and conditional rendering of file management UI.",
  "frontend/src/components/AccessDenied.tsx": "Pending-approval screen showing user's principal ID with copy functionality and instructions.",
  "frontend/src/components/AdminManagement.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/FileList.tsx": "File and folder management UI with search, navigation, uploads, deletion, previews, and full-path search result handling.",
  "frontend/src/components/FilePreviewModal.tsx": "Modal component that loads and previews images, videos, audio, documents, and text files with navigation, fullscreen, and download support.",
  "frontend/src/components/FileUpload.tsx": "Empty placeholder file for a file upload component.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link with an icon.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling authentication, theme toggle, user info display, and admin panel access.",
  "frontend/src/components/ManagePanel.tsx": "Admin panel modal for managing members, roles, and storage stats with add/remove actions.",
  "frontend/src/components/ProfileSetup.tsx": "User profile setup form that validates username uniqueness and saves the profile.",
  "frontend/src/components/ThemeToggle.tsx": "Button that switches between light and dark themes.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on the current identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider for managing Internet Identity login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user auth, access checks, profile actions, file listing, and search, all backed by an actor API.",
  "frontend/src/index.css": "Tailwind base file defining theme variables, dark mode variants, and global styling.",
  "frontend/src/lib/appVersion.ts": "Exports the application version constant 0.2.67.",
  "frontend/src/lib/canisterIds.ts": "Resolves backend and frontend canister IDs from env variables, window, URL, or fallbacks.",
  "frontend/src/lib/fileTypes.ts": "Utility functions for parsing file extensions, determining MIME types, and identifying previewable file categories.",
  "frontend/src/lib/search.ts": "Provides case‑insensitive search term normalization and simple substring matching.",
  "frontend/src/main.tsx": "Application entrypoint setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, radii, and registering plugins.",
  "project_state.json": "JSON describing project state, pending feature requests, and notes related to file search fixes and version updates."
}