{
  "backend/main.mo": "Canister backend defining storage, access control, approval flow, user profiles, and file/folder metadata with related query and update APIs.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend components, hooks, and utilities.",
  "frontend/index.html": "Basic HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Main React app managing authentication, access checks, profile gating, query cleanup, layout, and canister ID initialization.",
  "frontend/src/components/AccessDenied.tsx": "Pending-approval screen showing the user's principal with copy support and instructions to contact an admin.",
  "frontend/src/components/AdminManagement.tsx": "Empty placeholder file for admin management component.",
  "frontend/src/components/FileGallery.tsx": "Gallery‑style file and folder display with selection, previews, category icons, and action menus for downloads, moves, and deletion.",
  "frontend/src/components/FileList.tsx": "Main file browser component handling folder navigation, sorting, uploads, previews, and multi-select operations.",
  "frontend/src/components/FileListHeaderRow.tsx": "Table header row for the file list with sortable columns and optional select-all checkbox.",
  "frontend/src/components/FilePreviewModal.tsx": "Modal for previewing images, videos, audio, documents, and text files with navigation and fullscreen support.",
  "frontend/src/components/FileUpload.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/Footer.tsx": "Footer displaying app version, copyright, and link attribution.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling authentication, theme toggle, user info display, and admin access.",
  "frontend/src/components/ManagePanel.tsx": "Admin panel for managing members, roles, and viewing storage statistics.",
  "frontend/src/components/ProfileSetup.tsx": "Form component that handles username input with debounced uniqueness checks and saves the user profile.",
  "frontend/src/components/ThemeToggle.tsx": "Button that toggles between light and dark themes using next-themes.",
  "frontend/src/components/ZoomPanViewer.tsx": "Wrapper that provides zooming and panning interactions for its children with mouse and wheel events.",
  "frontend/src/hooks/useAccessBootstrap.ts": "Bootstrap hook that initializes access control once per session and refreshes related React Query caches.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor based on the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and auth state via AuthClient.",
  "frontend/src/hooks/usePerFolderViewMode.ts": "Session-only state hook that stores and updates view mode per folder.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user access, profile, file operations, and backend mutations using the actor.",
  "frontend/src/index.css": "Tailwind base layers and CSS variables defining light and dark theme color tokens.",
  "frontend/src/lib/appVersion.ts": "Exports the current application version string.",
  "frontend/src/lib/canisterIds.ts": "Resolves backend and frontend canister IDs from multiple environment sources and provides helper accessors.",
  "frontend/src/lib/dragDropDirectory.ts": "Extracts dropped files and directories using the FileSystem API and builds relative paths, with fallbacks and error handling.",
  "frontend/src/lib/fileLinks.ts": "Generates fully qualified direct download URLs for files and copies them to the clipboard with fallbacks.",
  "frontend/src/lib/fileTypes.ts": "Provides utilities for file extensions, MIME type lookup, type classification, and generating human-readable labels.",
  "frontend/src/lib/folderNavigation.ts": "Builds folder paths, resolves folder IDs from path segments, and determines containing paths for files and folders.",
  "frontend/src/lib/folderUpload.ts": "Extracts folder structures from FileList inputs and uploads folders and files recursively with progress and empty-file handling.",
  "frontend/src/lib/formatTime.ts": "Formats bigint nanosecond timestamps into readable dates and compact time strings.",
  "frontend/src/lib/id.ts": "Generates secure 32‑byte random hex IDs for uploads.",
  "frontend/src/lib/searchNormalize.ts": "Normalizes strings for Unicode-aware, case-insensitive search and checks substring containment.",
  "frontend/src/lib/sortFileSystemItems.ts": "Provides deterministic sorting for file and folder items with support for multiple fields and stable tie-breakers.",
  "frontend/src/lib/subtreeIndex.ts": "Builds a parent‑child index of folders and returns all descendant folder IDs from a given start folder.",
  "frontend/src/main.tsx": "Initializes the React app root, setting up React Query and the Internet Identity provider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project state, feature requests, and metadata for the Drive Browser build."
}