{
  "backend/main.mo": "Main backend canister implementing storage, access control, user approval, file and folder metadata management, and admin‑restricted configuration such as canister IDs and app version 0.3.87.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of all major frontend files including components, hooks, and utilities.",
  "frontend/index.html": "HTML entry point defining root element and loading the main frontend script.",
  "frontend/src/App.tsx": "Top‑level React app handling authentication, access control bootstrap, profile flow, conditional UI routing, and query cleanup when access is lost.",
  "frontend/src/components/AccessDenied.tsx": "Component showing a pending‑approval message with copyable Principal ID and instructions for contacting an admin.",
  "frontend/src/components/AdminManagement.tsx": "Empty placeholder file for admin management UI logic.",
  "frontend/src/components/FileList.tsx": "Main file browser component supporting search, navigation, uploads, folder creation, deletion, drag‑and‑drop, file preview modal, and breadcrumb handling.",
  "frontend/src/components/FilePreviewModal.tsx": "Modal component that loads and previews files of various types with navigation, fullscreen, and download support.",
  "frontend/src/components/FileUpload.tsx": "Empty file placeholder for a file upload component.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header handling authentication, profile display, admin panel access, and theme toggling.",
  "frontend/src/components/ManagePanel.tsx": "Admin dialog for managing members, roles, storage stats, and removing users with reactive UI updates.",
  "frontend/src/components/ProfileSetup.tsx": "Form for creating a user profile with username validation and uniqueness checks.",
  "frontend/src/components/ThemeToggle.tsx": "Button toggling between light and dark themes using next-themes.",
  "frontend/src/hooks/useAccessBootstrap.ts": "Hook that ensures access control initialization runs once per session and refreshes related queries.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user access checks, profiles, file operations, and admin interactions using an actor backend.",
  "frontend/src/index.css": "Sets up Tailwind base styles and theme variables for light and dark modes via CSS custom properties.",
  "frontend/src/lib/appVersion.ts": "Exports the current application version string.",
  "frontend/src/lib/canisterIds.ts": "Resolves backend and frontend canister IDs from multiple environment and runtime sources with fallbacks.",
  "frontend/src/lib/fileLinks.ts": "Provides helpers for constructing full direct file URLs and copying them to the clipboard with toast notifications.",
  "frontend/src/lib/fileTypes.ts": "Offers utility functions for determining file extensions, MIME types, and whether files are previewable.",
  "frontend/src/lib/searchNormalize.ts": "Includes functions for Unicode-aware, case-insensitive search normalization and substring matching.",
  "frontend/src/lib/subtreeIndex.ts": "Computes a set of folder IDs representing a subtree by indexing and recursively traversing child folders.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with query and Internet Identity providers before rendering.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, animations, and container settings, with plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing current fix requests, known issues, and feature requirements related to file preview, search behavior, and UI layout changes."
}