{
  "backend/main.mo": "Motoko backend actor providing blob storage, access control, user approval, file and folder metadata management, and admin role handling.",
  "feature_evidence.json": "Feature evidence report mapping requested features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend components and hooks.",
  "frontend/index.html": "Base HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling authentication, access checks, profile gating, canister ID setup, and conditional UI routing.",
  "frontend/src/components/AccessDenied.tsx": "Pending-approval screen showing the user's principal ID with copy-to-clipboard support and guidance to contact an admin.",
  "frontend/src/components/AdminManagement.tsx": "Empty placeholder file for the admin management UI.",
  "frontend/src/components/FileGallery.tsx": "Grid-based file and folder gallery with selection, previews, actions, type detection, and navigation callbacks.",
  "frontend/src/components/FileList.tsx": "Main file browser component handling folder navigation, file operations, previews, uploads, and sorting.",
  "frontend/src/components/FileListHeaderRow.tsx": "Renders the sortable header row for the file list with optional bulk-select controls.",
  "frontend/src/components/FilePreviewModal.tsx": "Displays a modal for previewing images, videos, audio, documents, or text files with navigation support.",
  "frontend/src/components/FileUpload.tsx": "Empty placeholder file for upload functionality.",
  "frontend/src/components/Footer.tsx": "Shows the footer with app version, copyright, and link attribution.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling authentication, user info display, theme toggle, and admin panel access.",
  "frontend/src/components/ManagePanel.tsx": "Admin management panel supporting member listing, adding, removing, and viewing storage stats.",
  "frontend/src/components/ProfileSetup.tsx": "A username setup form that debounces input, checks uniqueness, and saves the profile with validation and error handling.",
  "frontend/src/components/ThemeToggle.tsx": "A button that switches between light and dark themes using next-themes.",
  "frontend/src/components/ZoomPanViewer.tsx": "A container enabling zoom and pan interactions around its children with wheel and mouse drag support.",
  "frontend/src/hooks/useAccessBootstrap.ts": "Bootstraps access control once per session and invalidates related React Query caches after initialization.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout helpers, and initializes AuthClient with saved identities.",
  "frontend/src/hooks/usePerFolderViewMode.ts": "Stores per-folder view mode in memory and exposes getters and setters for list or gallery modes.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for calling actor methods related to access, profiles, files, and metadata operations.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark modes, plus custom component styles.",
  "frontend/src/lib/appVersion.ts": "Exports the current app version constant.",
  "frontend/src/lib/canisterIds.ts": "Collects backend and frontend canister IDs from various environment sources with multiple fallbacks.",
  "frontend/src/lib/dragDropDirectory.ts": "Recursively extracts dropped directory contents and detects directories using the FileSystem API.",
  "frontend/src/lib/fileLinks.ts": "Provides utilities to generate file URLs, copy links, and download files via blob URLs.",
  "frontend/src/lib/fileTypes.ts": "Determines file extensions, MIME types, category checks, and human-readable labels.",
  "frontend/src/lib/fileTypeTints.ts": "Maps file categories to CSS tint classes and provides folder/unknown tint helpers.",
  "frontend/src/lib/folderNavigation.ts": "Resolves folder paths, builds breadcrumbs, and retrieves parent/containing folder paths.",
  "frontend/src/lib/folderUpload.ts": "Extracts folder structures, validates paths, and uploads folder trees with folder creation and progress callbacks.",
  "frontend/src/lib/formatFileSize.ts": "Formats byte sizes into human‑readable units using base‑1024 scaling.",
  "frontend/src/lib/formatTime.ts": "Provides functions to convert bigint nanosecond timestamps into formatted date/time strings with various formats.",
  "frontend/src/lib/id.ts": "Generates a cryptographically secure 32‑byte random hex ID.",
  "frontend/src/lib/searchNormalize.ts": "Normalizes text for diacritics-insensitive search and checks substring matches using normalized strings.",
  "frontend/src/lib/sortFileSystemItems.ts": "Sorts FileSystemItem arrays deterministically by field and direction with multiple stable tie-breakers.",
  "frontend/src/lib/subtreeIndex.ts": "Builds a set of folder IDs representing a folder’s full subtree using a parent-to-children map.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Describes project state and active UI fix requirements for the Drive Browser app."
}