{
  "backend/main.mo": "Main backend actor implementing file/folder storage with blob management, access control with admin/member/guest roles, user approval workflow, profile management, and operations including upload, download, search, move, delete, and storage statistics.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: adding clickable path/location information to search results in FileList component, and updating the app version to 0.4.121.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including App.tsx with authentication and access control, FileList with search and folder navigation, Header, Footer, FileUpload, ProfileSetup, AccessDenied, and various hooks for backend queries.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component orchestrating authentication via Internet Identity, access control bootstrap, conditional rendering of pending approval/profile setup/file management screens, folder navigation state, and automatic frontend canister ID population.",
  "frontend/src/components/AccessDenied.tsx": "Pending approval screen component displaying a clock icon, user's shortened Principal ID with copy-to-clipboard functionality, and instructions to contact an administrator for access.",
  "frontend/src/components/AdminManagement.tsx": "Empty file placeholder for admin management dialog component.",
  "frontend/src/components/FileGallery.tsx": "Gallery view component for files and folders with grid layout, selection checkboxes, action dropdowns (download, copy link, move, delete), folder navigation, file preview, and clickable location paths for search results.",
  "frontend/src/components/FileList.tsx": "Main file browser component that displays folder contents with list/grid views, handles file/folder operations (upload, delete, move, create), search, sorting, drag-and-drop, and integrates preview/gallery modals.",
  "frontend/src/components/FileListHeaderRow.tsx": "Table header component for file list view with sortable columns (name, type, created, size), select-all checkbox, and optional location column for search results.",
  "frontend/src/components/FilePreviewModal.tsx": "Modal component for previewing files (images, videos, audio, documents, text) with navigation between files, fullscreen/maximize modes, zoom/pan for images, and download functionality.",
  "frontend/src/components/FileUpload.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Application footer displaying copyright, version number, and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Top navigation bar with app branding, theme toggle, Internet Identity authentication, user profile display with copyable principal ID, and admin management panel access.",
  "frontend/src/components/ManagePanel.tsx": "Admin panel dialog for managing members (add/remove with roles), viewing storage statistics, displaying system info (version, canister IDs), with protection against removing the first admin.",
  "frontend/src/components/ProfileSetup.tsx": "First-time user profile setup form with real-time username uniqueness validation, debounced checking, and error handling for duplicate usernames.",
  "frontend/src/components/ThemeToggle.tsx": "A button component that toggles between light and dark themes using next-themes, displaying animated sun and moon icons from lucide-react.",
  "frontend/src/components/ZoomPanViewer.tsx": "A container component that provides zoom (via mouse wheel) and pan (via click-and-drag) functionality for its children, with automatic reset when children change.",
  "frontend/src/hooks/useAccessBootstrap.ts": "A hook that automatically calls initializeAccessControl() once per authenticated session and invalidates access-related React Query caches after bootstrap completes, using sessionStorage to prevent duplicate calls.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and manages an authenticated or anonymous backend actor using React Query, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout, managing identity state and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/usePerFolderViewMode.ts": "A hook that manages per-folder view mode (list or gallery) in memory for the current session, with each folder having its own state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, file/folder management, admin functions, and access control, with client-side search filtering and subtree indexing.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/src/lib/appVersion.ts": "Exports the application version constant (0.4.121).",
  "frontend/src/lib/canisterIds.ts": "Utility functions that retrieve backend and frontend canister IDs from multiple sources including environment variables, URL parameters, hostname, and window object.",
  "frontend/src/lib/dragDropDirectory.ts": "Handles drag-and-drop file and directory extraction using the FileSystem API, recursively traversing directories to collect files with their relative paths.",
  "frontend/src/lib/fileLinks.ts": "Provides utilities for generating direct download URLs, copying file links to clipboard, and downloading files with correct filenames using blob URLs.",
  "frontend/src/lib/fileTypes.ts": "Provides file extension detection, MIME type mapping, and categorization functions (image, video, audio, document, code, archive, text) with human-readable type labels.",
  "frontend/src/lib/fileTypeTints.ts": "Maps file categories and folders to theme-aware CSS tint classes for visual differentiation in the UI.",
  "frontend/src/lib/folderNavigation.ts": "Handles folder path resolution, breadcrumb generation, and navigation logic for traversing the folder hierarchy.",
  "frontend/src/lib/folderUpload.ts": "Manages recursive folder uploads by creating folder structures first, then uploading non-empty files with progress tracking and empty file skipping.",
  "frontend/src/lib/formatFileSize.ts": "Formats byte sizes (number or bigint) into human-readable strings using base-1024 units (B, KB, MB, GB, TB).",
  "frontend/src/lib/formatTime.ts": "Converts backend Time values (bigint nanoseconds) into formatted date/time strings with full, compact, and date-only variants.",
  "frontend/src/lib/id.ts": "Generates cryptographically secure 32-byte random IDs as hex strings for file and folder identifiers.",
  "frontend/src/lib/searchNormalize.ts": "Normalizes text for Unicode-aware, case-insensitive, diacritics-insensitive search by decomposing characters and removing accents.",
  "frontend/src/lib/sortFileSystemItems.ts": "Exports a function to sort FileSystemItem arrays by name, size, type, created, or updated date with configurable direction and stable tie-breakers (kind, name, id).",
  "frontend/src/lib/subtreeIndex.ts": "Builds a set of folder IDs representing a subtree by constructing a parent-to-children map and recursively traversing descendants from a given start folder.",
  "frontend/src/main.tsx": "React application entry point that renders the App component wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens (using oklch), container settings, border radius variables, animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project metadata tracking two existing features: adding clickable path navigation to search results and updating the app version to 0.4.121."
}