{
  "backend/main.mo": "Motoko backend actor managing blob storage, user roles, approvals, profiles, folders, files, and related metadata with access control APIs.",
  "feature_evidence.json": "Feature evidence report listing implemented UI features, related files, components, test IDs, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend files.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component handling authentication, access control flow, profile setup, query cleanup, and rendering of the file interface.",
  "frontend/src/components/AccessDenied.tsx": "UI component showing pending-approval state with copyable Principal ID and instructions.",
  "frontend/src/components/AdminManagement.tsx": "Empty placeholder file for admin management UI.",
  "frontend/src/components/FileList.tsx": "Full file manager handling browsing, search, uploads, folder navigation, sorting, deletion, and file preview modal.",
  "frontend/src/components/FileListHeaderRow.tsx": "Renders a sortable file list header row with clickable columns and sort arrows.",
  "frontend/src/components/FilePreviewModal.tsx": "Displays a modal for previewing files with support for images, videos, audio, documents, text, and navigation.",
  "frontend/src/components/FileUpload.tsx": "Empty file with no implementation.",
  "frontend/src/components/Footer.tsx": "Shows the app footer with version info and a promotional link.",
  "frontend/src/components/Header.tsx": "Renders the main header with authentication controls, user info, theme toggle, and admin panel access.",
  "frontend/src/components/ManagePanel.tsx": "Provides an admin panel for managing members, roles, and storage stats.",
  "frontend/src/components/ProfileSetup.tsx": "Handles initial user profile creation with username validation and uniqueness checks.",
  "frontend/src/components/ThemeToggle.tsx": "Toggles between light and dark themes using next-themes.",
  "frontend/src/components/ZoomPanViewer.tsx": "Provides zoom and pan functionality for wrapped content using mouse interactions.",
  "frontend/src/hooks/useAccessBootstrap.ts": "Runs initializeAccessControl once per session per principal and refreshes access-related React Query caches.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for access checks, user profiles, file listings, and related mutations using the actor.",
  "frontend/src/index.css": "Tailwind CSS setup with light/dark theme variables and base styles.",
  "frontend/src/lib/appVersion.ts": "Exports the application version constant.",
  "frontend/src/lib/canisterIds.ts": "Resolves backend and frontend canister IDs from multiple environment and runtime sources.",
  "frontend/src/lib/dragDropDirectory.ts": "Extracts dropped files and directories using the FileSystem API and provides directory detection.",
  "frontend/src/lib/fileLinks.ts": "Builds full direct file URLs and copies them to the clipboard with fallbacks and notifications.",
  "frontend/src/lib/fileTypes.ts": "Provides utilities for extracting file extensions, determining MIME types, checking file categories, and generating human-readable type labels.",
  "frontend/src/lib/folderNavigation.ts": "Implements helpers for resolving folder paths, building breadcrumbs, and determining parent paths for files and folders.",
  "frontend/src/lib/folderUpload.ts": "Handles recursive folder upload by extracting folder structures, validating relative paths, creating folders, and uploading files with progress callbacks.",
  "frontend/src/lib/formatTime.ts": "Formats bigint nanosecond timestamps into readable or compact date/time strings with error handling.",
  "frontend/src/lib/id.ts": "Generates secure 32‑byte random hex IDs for uploads.",
  "frontend/src/lib/searchNormalize.ts": "Normalizes strings for case- and diacritics-insensitive search and provides a substring match helper.",
  "frontend/src/lib/sortFileSystemItems.ts": "Sorts file system items deterministically by various fields with stable tie‑breakers and type-aware logic.",
  "frontend/src/lib/subtreeIndex.ts": "Builds a deterministic set of folder IDs in a subtree using a parent‑child index and recursive traversal.",
  "frontend/src/main.tsx": "Initializes the React app with query client and Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, dark mode, content paths, plugins, and design tokens.",
  "project_state.json": "Tracks project state for restoring search result folder-path and filename-click behaviors, lists existing features and pending requests, and notes a file upload issue."
}