{
  "backend/main.mo": "Main backend actor implementing storage, access control, approval workflows, user profiles, and file/folder metadata management with role-based permissions.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities and behavior of various frontend files and components.",
  "frontend/index.html": "HTML entry point defining the root container and loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Top-level React component controlling authentication, access checks, profile flow, query cleanup, and rendering of the main file-management UI.",
  "frontend/src/components/AccessDenied.tsx": "UI component showing a pending-approval screen with copyable principal ID and instructions for requesting admin access.",
  "frontend/src/components/AdminManagement.tsx": "Empty placeholder file for the AdminManagement component.",
  "frontend/src/components/FileList.tsx": "Large file/folder management UI handling browsing, search, uploads, deletion, previews, navigation, and breadcrumb/path resolution.",
  "frontend/src/components/FilePreviewModal.tsx": "Modal component that loads and previews various file types with navigation, fullscreen, and zoom support.",
  "frontend/src/components/FileUpload.tsx": "Empty file placeholder, no implementation provided.",
  "frontend/src/components/Footer.tsx": "Renders site footer with branding, version info, and external link.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling authentication, user profile display, admin tools, and theme toggle.",
  "frontend/src/components/ManagePanel.tsx": "Admin panel for managing members, roles, storage stats, and member removal.",
  "frontend/src/components/ProfileSetup.tsx": "User onboarding form to choose and validate a unique username before saving the profile.",
  "frontend/src/components/ThemeToggle.tsx": "Button to switch between light and dark themes using next-themes.",
  "frontend/src/components/ZoomPanViewer.tsx": "Container providing zoom and pan interactions for wrapped content.",
  "frontend/src/hooks/useAccessBootstrap.ts": "Hook that initializes access control once per session and refreshes related query caches.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current identity, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handles identity loading, login, logout, and exposes status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for calling backend actor methods related to user roles, profiles, approval, files, and search operations.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/appVersion.ts": "Exports the current application version string.",
  "frontend/src/lib/canisterIds.ts": "Retrieves backend and frontend canister IDs from various environment sources with multiple fallbacks.",
  "frontend/src/lib/dragDropDirectory.ts": "Handles extracting files and directory contents from drag‑and‑drop events, supporting recursive traversal.",
  "frontend/src/lib/fileLinks.ts": "Builds full direct file URLs and provides clipboard copying utilities with fallbacks and notifications.",
  "frontend/src/lib/fileTypes.ts": "Provides helpers to extract extensions, determine MIME types and previewability, and map file extensions to readable labels.",
  "frontend/src/lib/folderNavigation.ts": "Utilities for resolving folder paths, building breadcrumbs, and navigating or locating folders and file parent folders.",
  "frontend/src/lib/folderUpload.ts": "Validates folder uploads, creates nested folders, and uploads files recursively with progress callbacks.",
  "frontend/src/lib/searchNormalize.ts": "Normalizes strings for case- and diacritics-insensitive search and checks substring inclusion.",
  "frontend/src/lib/subtreeIndex.ts": "Builds a set of folder IDs representing all descendants of a given folder using a parent–child index.",
  "frontend/src/main.tsx": "Application entry point that sets up React, query client, Internet Identity provider, and renders the app.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, animations, plugins, and theme extensions.",
  "project_state.json": "Captures current project state, known issues, and feature requests for version 0.3.91."
}