{
  "backend/main.mo": "Main backend actor implementing file/folder storage with blob management, access control, user approval workflow, profile management, admin functions, and storage statistics. Includes file/folder CRUD operations, search, move, rename, and recursive deletion with version tracking (0.4.109).",
  "feature_evidence.json": "Feature evidence report documenting the removal of tooltips from three view mode toggle buttons in the toolbar while preserving all other button tooltips, affecting FileList.tsx component.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing authentication flow, access control, file management UI, search functionality, profile setup, theme toggling, and component interactions.",
  "frontend/index.html": "Root HTML template for the fget application with viewport meta tag and script entry point to main.tsx.",
  "frontend/src/App.tsx": "Main React application component orchestrating authentication via Internet Identity, access control bootstrapping, conditional rendering of pending approval/profile setup/file management screens, folder navigation state, and automatic query cleanup for unauthenticated or unapproved users.",
  "frontend/src/components/AccessDenied.tsx": "Pending approval screen component displaying a clock icon, user's Principal ID with copy-to-clipboard functionality, and instructions to contact an administrator for access.",
  "frontend/src/components/AdminManagement.tsx": "Empty file placeholder for admin management component.",
  "frontend/src/components/FileGallery.tsx": "Gallery view component rendering files and folders as cards with thumbnails, selection checkboxes, action dropdown menus (download, copy link, move, delete), and search result path navigation with clickable breadcrumbs.",
  "frontend/src/components/FileList.tsx": "Main file browser component that displays folder contents with support for file/folder operations (upload, delete, move, create), search, sorting, multiple selection, drag-and-drop, and toggleable grid/list view modes with per-folder view persistence.",
  "frontend/src/components/FileListHeaderRow.tsx": "Table header component for file list view with sortable columns (name, type, created, size), select-all checkbox, and optional location column for search results.",
  "frontend/src/components/FilePreviewModal.tsx": "Modal dialog for previewing files (images, videos, audio, documents, text) with navigation between files, zoom/pan for images, fullscreen support, and download functionality.",
  "frontend/src/components/FileUpload.tsx": "Empty file component (no content).",
  "frontend/src/components/Footer.tsx": "Application footer displaying copyright, version number, and attribution link to caffeine.ai with UTM tracking.",
  "frontend/src/components/Header.tsx": "Top navigation bar with app branding, authentication controls (Internet Identity login/logout), user profile display with copyable principal ID, theme toggle, and admin panel access for authorized users.",
  "frontend/src/components/ManagePanel.tsx": "Admin panel dialog for managing system members (add/remove users with roles), viewing storage statistics, displaying system info (version, canister IDs), with protection against deleting the first admin and auto-logout when current user is removed.",
  "frontend/src/components/ProfileSetup.tsx": "Initial profile setup form for new users to choose a unique username with real-time validation, debounced uniqueness checking, and error handling for duplicate usernames.",
  "frontend/src/components/ThemeToggle.tsx": "A button component that toggles between light and dark themes using next-themes, displaying animated sun/moon icons from lucide-react.",
  "frontend/src/components/ZoomPanViewer.tsx": "A container component that provides zoom (via mouse wheel) and pan (via click-drag) functionality for its children, with automatic reset when content changes.",
  "frontend/src/hooks/useAccessBootstrap.ts": "Hook that automatically calls initializeAccessControl() once per authenticated session and invalidates access-related React Query caches after bootstrap completes, using sessionStorage to prevent duplicate calls.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor using React Query, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout, managing identity state and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/usePerFolderViewMode.ts": "Hook that manages per-folder view mode (list or gallery) in memory for the current session, with each folder having its own independent view mode.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for all backend operations including user profiles, file/folder management, admin functions, storage stats, and access control with derived access checks.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including sidebar, chart, and component-specific styling.",
  "frontend/src/lib/appVersion.ts": "Exports the current application version string (0.4.133).",
  "frontend/src/lib/canisterIds.ts": "Utility functions to retrieve backend and frontend canister IDs from multiple sources including environment variables, URL parameters, hostname, and dfx-generated files.",
  "frontend/src/lib/dragDropDirectory.ts": "Handles drag-and-drop file and directory extraction using the FileSystem API, recursively traversing directories to collect files with their relative paths.",
  "frontend/src/lib/fileLinks.ts": "Provides utilities for generating direct download URLs, copying file links to clipboard, and downloading files with correct filenames using blob URLs.",
  "frontend/src/lib/fileTypes.ts": "Provides file type detection, MIME type mapping, and human-readable type labels based on file extensions, with category checks for images, videos, audio, documents, code, and archives.",
  "frontend/src/lib/fileTypeTints.ts": "Maps file categories and folders to theme-aware CSS tint classes for visual differentiation in both light and dark modes.",
  "frontend/src/lib/folderNavigation.ts": "Handles folder path resolution, breadcrumb generation, and navigation between folders using folder IDs and hierarchical relationships.",
  "frontend/src/lib/folderUpload.ts": "Manages recursive folder uploads by creating folder structures depth-first, then uploading non-empty files with progress tracking and empty file skipping.",
  "frontend/src/lib/formatFileSize.ts": "Formats byte sizes (number or bigint) into human-readable strings using base-1024 units (B, KB, MB, GB, TB).",
  "frontend/src/lib/formatTime.ts": "Converts backend Time values (bigint nanoseconds) to human-readable date/time strings in various formats using Intl.DateTimeFormat.",
  "frontend/src/lib/id.ts": "Generates cryptographically secure 32-byte random IDs as hex strings for file and folder identifiers.",
  "frontend/src/lib/searchNormalize.ts": "Normalizes text for Unicode-aware, case-insensitive, diacritics-insensitive search by decomposing characters and removing accents.",
  "frontend/src/lib/sortFileSystemItems.ts": "Exports a function to sort file system items by name, size, type, created, or updated date with deterministic tie-breakers (kind, name, id) for stable ordering.",
  "frontend/src/lib/subtreeIndex.ts": "Builds a set of folder IDs representing a subtree by creating a parent-to-children index and recursively traversing descendants from a given start folder.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the App component into the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens (using oklch), container settings, border radius variables, animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project metadata indicating a fix request to remove tooltips from three view mode toggle buttons in the toolbar while keeping all other button tooltips unchanged."
}