{
  "kind": "build_request",
  "title": "Restore search result clickable folder path and filename preview; bump version to 0.3.101",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the search results UI, render the containing-folder path as a clickable element (not a plain full file path including the filename) and when clicked, navigate to/open that containing folder (i.e., update currentFolderId and breadcrumb path to the folder that contains the search result item).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "in search results was a path (containing folder) which was clickable - but currently there is just full path to the files (including it's name) - visible on screenshot - switch that one back to working clickable path - which will open the containing folder."
        ]
      },
      "acceptanceCriteria": [
        "When search is active, each result shows a path representing the containing folder only (no filename appended).",
        "Clicking the displayed path navigates to that folder (currentFolderId and breadcrumb update accordingly) and clears search mode (searchTerm resets).",
        "No other UI behaviors are changed outside of the search results path element behavior."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the search results UI, make clicking a file’s filename open that file in the existing preview modal (same behavior as before the regression), without changing any preview/player functionality beyond restoring the click action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Also when I clicked filename in the search results it opened the file in preview - currently it does nothing, fix that to open in preview again - don't change anything in the preview/player or anything else I didn't ask!"
        ]
      },
      "acceptanceCriteria": [
        "When search is active and a result item is a file, clicking the filename opens the existing FilePreviewModal for that file.",
        "Preview navigation continues to work using the existing context behavior (no changes to preview/player features or UI besides restoring the click).",
        "Folder search results (if present) still navigate as before (no regression to folder click behavior)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Bump the application version constant to 0.3.101 so the UI displays version 0.3.101 wherever the centralized version is used.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Version to 0.3.101"
        ]
      },
      "acceptanceCriteria": [
        "APP_VERSION is updated to 0.3.101 and the displayed version in the app reflects 0.3.101."
      ]
    }
  ],
  "constraints": [
    "Do not implement or modify the file upload/folder upload behavior; the user explicitly chose to leave the failing upload issue for now.",
    "Do not change any preview/player behavior or UI beyond restoring filename click-to-preview from search results.",
    "Do not edit files under frontend/src/components/ui or any other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Fixing the known folder upload error that occurs after creating the folder.",
    "Any redesign of the search UI beyond restoring the two regressed interactions (clickable containing-folder path and filename click-to-preview)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}