{
  "kind": "build_request",
  "title": "Fix file preview click regression, enable recursive file search, and move current-path breadcrumb above filesystem list (v0.3.87)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Move the current-path breadcrumb div (the one containing the currently selected breadcrumb button; user referred to it as div \"5yv2go\") so it renders directly above the filesystem list (files/folders area) and not above the search bar.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "the one to move is the one containing the currently selected button - so the div 5yv2go, clear? goal is to display the path just above the filesystem and not above the search"
        ]
      },
      "acceptanceCriteria": [
        "Breadcrumb/current-path display appears immediately above the files/folders list area and below the search/actions row.",
        "The breadcrumb continues to function (clicking a breadcrumb navigates to that folder) with no other UI behavior changes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Restore file preview-on-click behavior so that clicking a file row reliably opens the preview modal (FilePreviewModal) for that file, as it did in the previous version, without changing unrelated file browser functionality.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-6"
        ],
        "quotes": [
          "why is preview not working when clicking on file?",
          "the preview-on-click was even in previous version, not idea why did you change it"
        ]
      },
      "acceptanceCriteria": [
        "Clicking any previewable file in the file list opens the preview modal and displays the selected file.",
        "Preview navigation (next/previous within the modal) continues to work based on the current visible list context (normal listing vs. search results).",
        "Folder clicks still navigate into folders and do not trigger the file preview modal."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix subtree search so recursive searching includes files in descendant folders (not just folders), including when searching from the root context, while preserving existing search behavior (case/diacritics-insensitive name matching).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-6"
        ],
        "quotes": [
          "still the recursive search for files doesn't work",
          "simply add possibility of recursive search for files as well - currectly it works on folders only"
        ]
      },
      "acceptanceCriteria": [
        "When a search term is entered, results include matching files located in any descendant folder under the current folder.",
        "When searching from the root (no current folder selected), results include matching files from the entire drive (not only root-level files).",
        "Existing folder matching and search UI (including the clear-search cross) continues to work as before."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Bump the app version to 0.3.87 anywhere the version is surfaced in code/config (at minimum the frontend appVersion constant and the backend version value if present).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Version to 0.3.87"
        ]
      },
      "acceptanceCriteria": [
        "Frontend reports APP_VERSION as 0.3.87.",
        "Backend version (if defined in backend code) is updated to 0.3.87."
      ]
    }
  ],
  "constraints": [
    "Do not change unrelated functionality; keep existing working behaviors intact to avoid regressions."
  ],
  "nonGoals": [
    "Adding new search filters beyond recursive name search for files/folders (e.g., content search, mime-type filters).",
    "Changing upload behavior (including folder upload semantics) beyond what is necessary for the requested fixes.",
    "Introducing new authentication or access-control behavior changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}