{
  "kind": "build_request",
  "title": "Restore always-visible row actions, labeled top buttons order, searchable breadcrumb path, and bump version to 0.4.111",
  "projectName": "Drive Browser",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore file/folder row action buttons in List view so they are visible at all times (not only on mouse hover), while keeping tooltips on those action buttons.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "it's nice! but you again changed the action buttons to appear only on mouse hoover - restore it to be visible all the time (keep the tooltips for them!)."
        ]
      },
      "acceptanceCriteria": [
        "In List view, each row’s action buttons are visible without hovering (default state).",
        "Tooltips for the row action buttons still appear on hover/focus.",
        "No other row layout/behavior changes beyond making the buttons always visible."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Restore the top action buttons in the File Browser header area to use labeled buttons (not icon-only) with no tooltips, and enforce the button order: Upload Files, then Upload Folder, then Create Folder.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Also restore the Create Folder, Upload Files and Upload Folder buttons to be with labels (as were) - and without tooltips! - First should be Upload Files, then Upload Folder and last Create Folder"
        ]
      },
      "acceptanceCriteria": [
        "The top actions are displayed as labeled buttons: “Upload Files”, “Upload Folder”, “Create Folder”.",
        "No tooltips are shown for these top action buttons.",
        "The buttons appear in the specified order: Upload Files → Upload Folder → Create Folder.",
        "Click behavior for each action remains unchanged."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Restore the clickable folder path/breadcrumb context when viewing search results so users can click the displayed path to navigate to the containing folder.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Also you removed the clickable folder path when searching - restore it!"
        ]
      },
      "acceptanceCriteria": [
        "When search is active, each search result shows a folder path/breadcrumb context that is clickable.",
        "Clicking the path navigates to the corresponding containing folder (and exits search mode).",
        "Navigation via the clickable path works for both file results and folder results.",
        "No other search UI/behavior changes beyond restoring the clickable path."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Set the application version to 0.4.111 and ensure it is reflected wherever the app version is displayed in the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "version should be 0.4.111 - my typo"
        ]
      },
      "acceptanceCriteria": [
        "The version constant is updated to 0.4.111 (e.g., the value exported from frontend/src/lib/appVersion.ts).",
        "The footer (and any other version display) shows v0.4.111 after rebuild."
      ]
    }
  ],
  "constraints": [
    "No other changes beyond the UI restores and version bump requested by the user (\"No other changes!\").",
    "Do not modify files under frontend immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Backend/canister logic changes.",
    "Any redesign or new UI features unrelated to the specified restores.",
    "Changing tooltip behavior for anything other than the specified top action buttons (which must have no tooltips)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}