{
  "kind": "build_request",
  "title": "Fix file type display, reposition Upload Files button, restore breadcrumb colors, and bump version",
  "projectName": "fget",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Display specific file types (JSON, Folder, etc.) in the Type column. For files with unknown or unrecognized file types, display 'N/A' instead of showing the entire filename.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-9",
          "msg-recent-10"
        ],
        "quotes": [
          "yes, for #1 still keep 'N/A' for unknowns (instead of showing the whole filename)",
          "File types: Display specific file types (JSON, Folder, etc.) with 'N/A' only for unknown file types (instead of showing the whole filename)"
        ]
      },
      "acceptanceCriteria": [
        "Files with recognized types display their specific type label (e.g., 'JSON', 'Folder')",
        "Files with unknown or unrecognized types display 'N/A' in the Type column",
        "The entire filename is never displayed in the Type column"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Reposition the 'Upload Files' button to appear before the 'New Folder' button in the toolbar. Style it similar to the folder buttons with a subtle yellow border while keeping the blue color scheme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-8",
          "msg-recent-10"
        ],
        "quotes": [
          "upload files is not before New Folder button - also make it visually similar to the Folder buttons, just with the blue",
          "Upload Files button: Move before 'New Folder' button with folder button styling (subtle yellow border) while keeping the blue color"
        ]
      },
      "acceptanceCriteria": [
        "Upload Files button appears before New Folder button in the toolbar",
        "Upload Files button has a subtle yellow border similar to folder buttons",
        "Upload Files button retains its blue color scheme"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Restore the blue colors in the Drive path breadcrumb navigation (Drive > testup > test2 > test3) as shown in v0.4.121.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-8",
          "msg-recent-10"
        ],
        "quotes": [
          "the current Drive path also lost the colors - re-attaching screenshot from 0.4.121",
          "Drive path breadcrumb: Restore the blue colors in the navigation (Drive > testup > test2 > test3)"
        ]
      },
      "acceptanceCriteria": [
        "Breadcrumb navigation path segments display in blue color",
        "Visual appearance matches the v0.4.121 reference screenshot"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the application version to v0.4.127 in frontend/src/lib/appVersion.ts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-8",
          "msg-recent-10"
        ],
        "quotes": [
          "app version to 0.4.127",
          "Version: Bump to v0.4.127"
        ]
      },
      "acceptanceCriteria": [
        "APP_VERSION constant in appVersion.ts is set to '0.4.127'",
        "Version number displays correctly in the application footer"
      ]
    }
  ],
  "constraints": [],
  "nonGoals": [],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}