{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Drive Browser UI restores (row actions, header buttons, search breadcrumb) + version bump to 0.4.111",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make List view row action buttons always visible (no hover-only reveal) while preserving tooltips.",
      "acceptanceCriteria": [
        "In List view, each row’s action buttons are visible without hovering (default state).",
        "Tooltips for the row action buttons still appear on hover/focus.",
        "No other row layout/behavior changes beyond making the buttons always visible."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FileList.tsx",
          "operation": "modify",
          "description": "Update the List view row action area styling so action buttons are visible by default (remove any hover-only opacity/visibility classes) while keeping the existing Tooltip/TooltipTrigger wrappers intact for those row actions."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Restore labeled top action buttons (no tooltips) in the File Browser header and enforce the order Upload Files → Upload Folder → Create Folder.",
      "acceptanceCriteria": [
        "The top actions are displayed as labeled buttons: “Upload Files”, “Upload Folder”, “Create Folder”.",
        "No tooltips are shown for these top action buttons.",
        "The buttons appear in the specified order: Upload Files → Upload Folder → Create Folder.",
        "Click behavior for each action remains unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FileList.tsx",
          "operation": "modify",
          "description": "Adjust the File Browser header top actions to use labeled Button variants (not icon-only) for “Upload Files”, “Upload Folder”, and “Create Folder”, remove any Tooltip usage for these header buttons, and reorder them to Upload Files → Upload Folder → Create Folder without changing their existing click/upload/create behaviors."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Restore clickable breadcrumb/path context for search results so users can navigate to the containing folder and exit search mode.",
      "acceptanceCriteria": [
        "When search is active, each search result shows a folder path/breadcrumb context that is clickable.",
        "Clicking the path navigates to the corresponding containing folder (and exits search mode).",
        "Navigation via the clickable path works for both file results and folder results.",
        "No other search UI/behavior changes beyond restoring the clickable path."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FileList.tsx",
          "operation": "modify",
          "description": "In search mode rendering, restore display of each result’s containing folder path/breadcrumb context (for both file and folder results) and wire it to the existing click handler so clicking the path navigates to the containing folder and clears search state."
        },
        {
          "path": "frontend/src/lib/folderNavigation.ts",
          "operation": "modify",
          "description": "If needed to support the restored UI, add/adjust a minimal helper for generating a user-facing breadcrumb/path label for search results without changing existing navigation behavior; keep changes scoped strictly to enabling the clickable search path display."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Bump the app version to 0.4.111 and ensure all UI version displays reflect it.",
      "acceptanceCriteria": [
        "The version constant is updated to 0.4.111 (e.g., the value exported from frontend/src/lib/appVersion.ts).",
        "The footer (and any other version display) shows v0.4.111 after rebuild."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/appVersion.ts",
          "operation": "modify",
          "description": "Update APP_VERSION constant to \"0.4.111\"."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Verify the footer continues to display the app version via APP_VERSION and renders as v0.4.111 after the version bump (no design/behavior changes beyond ensuring the updated version is shown)."
        }
      ]
    }
  ]
}