{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "v0.3.91 frontend fixes: search-path navigation, upload button ordering, file type metadata, text preview navigation, version bump",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Fix search-result path segment navigation to resolve to valid folders within the current dataset and clear search context after navigating.",
      "acceptanceCriteria": [
        "In search results, clicking a path segment navigates to the intended folder containing the result (or the segment's folder) without errors.",
        "Navigation from search results does not depend on an incorrect root/drive; it always resolves to an existing folder in the current dataset.",
        "After navigation from a search path click, the folder breadcrumb reflects the actual folder path and search mode is exited/cleared (or otherwise results do not remain inconsistent with the new folder context)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/folderNavigation.ts",
          "operation": "modify",
          "description": "Adjust/extend folder path resolution utilities to support navigating from search-result breadcrumbs using stable folder IDs (e.g., deriving the target folder from the clicked segment + the searched item's parent chain) rather than relying on an incorrect root/drive context."
        },
        {
          "path": "frontend/src/components/FileList.tsx",
          "operation": "modify",
          "description": "Update search-result path/breadcrumb rendering and click handling to call the corrected folderNavigation utility with the searched item's context (e.g., its parent folder) and then update currentFolderId + folderPath consistently while clearing searchTerm to exit search mode."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Reorder FileList header action buttons to: Upload Files, New Folder, Upload Folder (only within the existing button group).",
      "acceptanceCriteria": [
        "The visual order of the three buttons is exactly: Upload Files, New Folder, Upload Folder.",
        "Button behavior remains unchanged (each still opens the correct dialog/picker).",
        "No other buttons outside this selected button group are reordered."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FileList.tsx",
          "operation": "modify",
          "description": "Reorder the existing header action button group to match the required order (Upload Files first, then New Folder, then Upload Folder) without changing handlers or affecting other UI controls."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Display an English file-type label next to file size in file list rows (folders excluded).",
      "acceptanceCriteria": [
        "Each file row in the main file list displays a file type label alongside the formatted size.",
        "The type label is derived from the file extension (fallback to a reasonable default such as \"FILE\" when no extension exists).",
        "Folder rows are not incorrectly given a file type label."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/fileTypes.ts",
          "operation": "modify",
          "description": "Add/adjust a helper that derives a displayable file type label from a filename/extension (e.g., PDF, JSON, TXT) with a safe fallback when missing."
        },
        {
          "path": "frontend/src/components/FileList.tsx",
          "operation": "modify",
          "description": "Update file row metadata rendering to include the computed file type label followed by a separator and the formatted size (English formatting like \"PDF • 145.19 KB\"), while ensuring folder rows do not show a type label."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Ensure text file preview includes Previous/Next navigation controls and keyboard Left/Right arrow navigation like other previews.",
      "acceptanceCriteria": [
        "When previewing a text-based file, visible Previous/Next navigation controls are available when there is more than one file in the current context.",
        "Clicking Previous/Next navigates to the adjacent file without closing the modal.",
        "Left/Right arrow keys navigate Previous/Next while previewing a text-based file (when navigation is available)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FileList.tsx",
          "operation": "modify",
          "description": "Ensure FilePreviewModal is always provided the full current-context file array and a stable currentFileIndex/onNavigateFile implementation for text files as well as other previewable files, so navigation controls are enabled when multiple files exist."
        },
        {
          "path": "frontend/src/components/FilePreviewModal.tsx",
          "operation": "modify",
          "description": "Verify navigation UI and keyboard handling is active for text previews (not gated by text rendering), and adjust modal key handling/visibility logic as needed so text files get the same Previous/Next behavior as other supported previews. Use the blob-storage component’s ExternalBlob direct URL/bytes capabilities as already integrated; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Bump frontend-displayed application version to 0.3.91 everywhere it is shown.",
      "acceptanceCriteria": [
        "Frontend displays version 0.3.91 (e.g., in the footer/version label).",
        "Backend storage stats/version reporting returns appVersion = \"0.3.91\".",
        "Upgrade does not break existing deployed state; migration is present/updated only if required for the existing stored state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/appVersion.ts",
          "operation": "modify",
          "description": "Update the exported frontend application version string to 0.3.91 so all UI version displays reflect the new version."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Confirm the footer continues to display the version from the centralized APP_VERSION constant and that the rendered text matches 0.3.91."
        }
      ]
    }
  ]
}