{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore clickable path in search results and update to v0.4.121",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add clickable path/location information to each search result row in the FileList component",
      "acceptanceCriteria": [
        "Each search result displays the folder path where the file is located",
        "The path is clickable and navigates to the containing folder",
        "Path display is clearly visible in the search results view"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FileList.tsx",
          "operation": "modify",
          "description": "Add a clickable path/location column to search result rows. When in search mode (searchTerm is non-empty), display the containing folder path for each file using the folderNavigation utility. The path should be clickable and call onFolderNavigate with the parent folder ID to navigate the user to the folder containing the file. Use the existing folder metadata from the getAllFolders query to resolve full folder paths. Ensure the path display integrates cleanly with the existing table layout and does not disrupt the current file operation buttons or sorting behavior."
        },
        {
          "path": "frontend/src/lib/folderNavigation.ts",
          "operation": "modify",
          "description": "Ensure the getFolderPath utility function can accept a file's parentId and return the full folder path string (e.g., 'Folder A / Folder B'). If the function does not already handle this case, extend it to support resolving paths for files in addition to folders. The path should be human-readable and suitable for display in the search results UI."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update the app version constant to '0.4.121'",
      "acceptanceCriteria": [
        "Version displayed in footer shows '0.4.121'"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/appVersion.ts",
          "operation": "modify",
          "description": "Update the exported app version constant from its current value to '0.4.121'. This is a simple constant change with no logic modifications required."
        }
      ]
    }
  ]
}