{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "File browser UI fixes: breadcrumb placement, preview-on-click regression, recursive subtree search for files, and version bump to v0.3.87",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Render the current-path breadcrumb directly above the files/folders list area (below the search/actions row).",
      "acceptanceCriteria": [
        "Breadcrumb/current-path display appears immediately above the files/folders list area and below the search/actions row.",
        "The breadcrumb continues to function (clicking a breadcrumb navigates to that folder) with no other UI behavior changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FileList.tsx",
          "operation": "modify",
          "description": "Reorder the FileList layout so the breadcrumb/current-path row is moved from the CardHeader section to the top of the CardContent, positioned immediately above the filesystem list area and below the search/actions row; keep existing breadcrumb click behavior intact and avoid changing other interactions."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Restore reliable preview-on-click for file rows while keeping folder navigation and other file browser behaviors unchanged.",
      "acceptanceCriteria": [
        "Clicking any previewable file in the file list opens the preview modal and displays the selected file.",
        "Preview navigation (next/previous within the modal) continues to work based on the current visible list context (normal listing vs. search results).",
        "Folder clicks still navigate into folders and do not trigger the file preview modal."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FileList.tsx",
          "operation": "modify",
          "description": "Ensure file rows (for items with __kind__ === 'file') consistently call handleFileClick on row click for previewable files, while folder rows only navigate into folders. Add/adjust event handling so action buttons inside a row (download/copy/move/delete) do not block row click when appropriate and do not accidentally trigger preview; use stopPropagation only for the action controls as needed."
        },
        {
          "path": "frontend/src/components/FilePreviewModal.tsx",
          "operation": "modify",
          "description": "Validate and, if necessary, adjust modal navigation inputs (allFiles/currentFileIndex/onNavigateFile) so next/previous navigation remains derived from the currently visible list context (normal listing vs. search results) after the click-handling fix. Keep the existing blob loading approach (uses ExternalBlob from the blob-storage component via getDirectURL/getBytes). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix recursive subtree search to include matching files in descendant folders (including from root) while preserving existing normalized name matching and search UI behavior.",
      "acceptanceCriteria": [
        "When a search term is entered, results include matching files located in any descendant folder under the current folder.",
        "When searching from the root (no current folder selected), results include matching files from the entire drive (not only root-level files).",
        "Existing folder matching and search UI (including the clear-search cross) continues to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useSearchSubtree client-side filtering so that when startFolderId is null (root context), matchingFiles includes files in any folder across the drive (i.e., files whose parentId is null OR whose parentId is any folder in the computed subtree/all-folders set), not just root-level files. Preserve containsNormalized() behavior for case/diacritics-insensitive matching and keep query keys/enablement and clear-search UI semantics unchanged."
        },
        {
          "path": "frontend/src/lib/subtreeIndex.ts",
          "operation": "modify",
          "description": "Review and, if needed, adjust buildSubtreeFolderIds usage assumptions to support full-drive file inclusion for root searches (e.g., ensure the produced set covers all folder IDs under the root so file parentId membership checks work reliably). Keep deterministic traversal and existing behavior for non-root startFolderId unchanged."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Bump frontend surfaced app version to 0.3.87.",
      "acceptanceCriteria": [
        "Frontend reports APP_VERSION as 0.3.87.",
        "Backend version (if defined in backend code) is updated to 0.3.87."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/appVersion.ts",
          "operation": "modify",
          "description": "Update the exported APP_VERSION constant from 0.3.86 to 0.3.87 so the frontend reports version 0.3.87 anywhere it is surfaced."
        }
      ]
    }
  ]
}