{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "v0.3.88: Restore click-to-open file preview with robust viewers and download fallback (without breaking search)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make file rows (in normal listing and search results) reliably open FilePreviewModal on click while preserving folder navigation and existing search behavior.",
      "acceptanceCriteria": [
        "In the main file list (non-search mode), clicking anywhere on a file row (not just a small sub-control) opens FilePreviewModal for that file.",
        "In search mode, clicking a file result row also opens FilePreviewModal for that file, and does not disrupt/clear the current search term unless the previous behavior already did so.",
        "Folder clicks still navigate into folders; file clicks do not navigate and instead open preview.",
        "No regressions to current recursive search behavior and results display (search remains functional and responsive)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FileList.tsx",
          "operation": "modify",
          "description": "Restore row-click behavior by wiring the file-row container click to open the existing FilePreviewModal for any file (including previously non-previewable ones), while keeping folder rows navigating into folders. Ensure action buttons (copy link, delete, move, etc.) stop propagation so row clicks remain reliable. Preserve current search state behavior (do not clear searchTerm on file click; keep existing folder/breadcrumb behavior unless already clearing)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Restore gallery-style previous/next navigation in FilePreviewModal for files in the current context (current folder listing or active search results), via UI controls and keyboard arrows.",
      "acceptanceCriteria": [
        "When FilePreviewModal is open and there are multiple files in the current context, previous/next navigation works via on-screen controls and left/right arrow keys.",
        "The navigation list/index only includes files from the current context (folder listing when not searching; search result list when searching).",
        "Navigating does not close the modal, does not change the current folder, and does not clear the search term."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FileList.tsx",
          "operation": "modify",
          "description": "Adjust the modal navigation source list from 'previewable files only' to 'all files in current context' so previous/next navigation matches the folder listing or the active search result list. Keep currentFileIndex consistent with the context list, and pass the correct allFiles/currentFileIndex/onNavigateFile props to FilePreviewModal without mutating folder/search state."
        },
        {
          "path": "frontend/src/components/FilePreviewModal.tsx",
          "operation": "modify",
          "description": "Ensure keyboard left/right navigation and on-screen previous/next controls operate over the full provided context file list (including unsupported types) without closing the modal or affecting search/folder state. Confirm the sidebar list selection and arrow availability reflect the passed currentFileIndex/allFiles accurately."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure FilePreviewModal supports robust in-browser previews for common types and shows a clear preview-unavailable state with download fallback for unsupported/unsafe types (no infinite loading).",
      "acceptanceCriteria": [
        "Opening a file with an unsupported extension does not remain stuck in a loading state; the modal displays a preview-unavailable message and a Download button.",
        "Supported types continue to preview using the existing implementations (image/video/audio direct URL, document iframe/blob URL, text decode).",
        "Download action works from both the header download button and the preview-unavailable state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FilePreviewModal.tsx",
          "operation": "modify",
          "description": "Fix unsupported-type handling so the loader always resolves: when the file extension is not image/video/audio/document/text, set a 'Preview not available' error/state and stop loading, while still allowing download. Keep existing preview implementations for supported types. Continue using the blob-storage ExternalBlob capabilities (getDirectURL for streaming media, getBytes for blob/text) as currently implemented; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Improve text previews to support both vertical and horizontal scrolling using browser-native scrolling, including in fullscreen/maximized states.",
      "acceptanceCriteria": [
        "Large text files can be scrolled vertically to view all lines.",
        "Long lines can be scrolled horizontally without wrapping truncation.",
        "Scrolling works in both normal and fullscreen/maximized modal states."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FilePreviewModal.tsx",
          "operation": "modify",
          "description": "Ensure the text preview container uses native overflow scrolling in both axes (outer container for vertical, inner/pre for horizontal without line wrapping) and that these overflow rules remain effective when the modal is maximized or fullscreen."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Bump the surfaced frontend app version to 0.3.88.",
      "acceptanceCriteria": [
        "frontend/src/lib/appVersion.ts exports APP_VERSION as '0.3.88'.",
        "backend/main.mo appVersion constant is '0.3.88'.",
        "Any UI surfaces that read these values show 0.3.88 after build."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/appVersion.ts",
          "operation": "modify",
          "description": "Update APP_VERSION export to '0.3.88' so any UI surfaces reading it display the new version."
        }
      ]
    }
  ]
}