{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore search result interactions (clickable containing-folder path + filename preview) and bump version to 0.3.101",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show containing-folder path (not full file path) in search results and make it clickable to navigate to that folder, updating currentFolderId and breadcrumbs and clearing search.",
      "acceptanceCriteria": [
        "When search is active, each result shows a path representing the containing folder only (no filename appended).",
        "Clicking the displayed path navigates to that folder (currentFolderId and breadcrumb update accordingly) and clears search mode (searchTerm resets).",
        "No other UI behaviors are changed outside of the search results path element behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FileList.tsx",
          "operation": "modify",
          "description": "Adjust search-results rendering so the path text represents the containing folder only (derive containing-folder id from item.parentId for files, and folder.parentId for folder results) and render that path as a clickable element that updates currentFolderId + folderPath (breadcrumbs) to the containing folder and clears searchTerm. Keep all other list interactions unchanged and ensure click handlers stopPropagation where needed to avoid altering row clicks."
        },
        {
          "path": "frontend/src/lib/folderNavigation.ts",
          "operation": "modify",
          "description": "Add or adjust a small helper (used by FileList search UI) to compute a search result item's containing folder id and/or human-readable containing-folder path string from allFolders without appending the filename; reuse existing breadcrumb/path helpers. Ensure behavior stays limited to search-result path display/navigation."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Restore click-to-preview on file filename in search results using the existing FilePreviewModal behavior without changing the preview/player features.",
      "acceptanceCriteria": [
        "When search is active and a result item is a file, clicking the filename opens the existing FilePreviewModal for that file.",
        "Preview navigation continues to work using the existing context behavior (no changes to preview/player features or UI besides restoring the click).",
        "Folder search results (if present) still navigate as before (no regression to folder click behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FileList.tsx",
          "operation": "modify",
          "description": "In the search-results row rendering for files, make the filename element clickable and wire it to the existing handleFileClick(file) so it opens the existing FilePreviewModal; ensure the click does not trigger any row/folder navigation (use stopPropagation as needed). Keep folder result click behavior unchanged."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Bump centralized app version constant to 0.3.101 so the UI displays the updated version wherever used.",
      "acceptanceCriteria": [
        "APP_VERSION is updated to 0.3.101 and the displayed version in the app reflects 0.3.101."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/appVersion.ts",
          "operation": "modify",
          "description": "Update APP_VERSION constant from 0.3.100 to 0.3.101."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Confirm the footer (and any other in-app version display) continues to source the version from APP_VERSION so it reflects 0.3.101; make only minimal adjustments if required."
        }
      ]
    }
  ]
}