{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix File Manager search matching (case-insensitive substring)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update File Manager search to execute backend subtree search using a normalized term and show matching files/folders via case-insensitive substring behavior, restoring normal folder view when cleared.",
      "acceptanceCriteria": [
        "When the user enters a non-empty search term, the UI shows at least one result when there are files/folders whose names contain the term as a case-insensitive substring (e.g., \"cs\" matches \"cs.json\").",
        "When the search term is cleared, the UI returns to showing the normal folder contents list.",
        "Search works while inside a subfolder (i.e., uses the current folder as the start point for the search).",
        "No console errors are emitted during searching, and the search request is actually executed (i.e., a backend call is made via the existing search query hook)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/search.ts",
          "operation": "create",
          "description": "Add small shared helpers to normalize search input (trim + lowercase) and perform case-insensitive substring checks for names; used by the File Manager search UI and the existing subtree-search query hook."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust the existing useSearchSubtree hook to normalize the incoming search term (via frontend/src/lib/search.ts) before computing the React Query key/enabled state and before calling the backend search capability, ensuring the search request is executed consistently and supports case-insensitive substring expectations."
        },
        {
          "path": "frontend/src/components/FileList.tsx",
          "operation": "modify",
          "description": "Update the File Manager search flow to use a normalized non-empty term for toggling between normal folder contents and search results, preserve searching from the current folder (start point), and ensure clearing the input returns to the standard folder contents without console errors."
        }
      ]
    }
  ]
}